export const fakeEventColumn = [
    {
        accessorKey: 'name',
        header: "Название",
    },
    {
        accessorKey: 'value',
        header: "Балл"
    },
    {
        accessorKey: 'date',
        header: "Дата"
    },
]

export const fakeEvent = [
    {
        "name": "Международная конференция по биотехнологиям",
        "date": "2024.01.10",
        "id": 1
    },
    {
        "name": "Форум молодых ученых",
        "date": "2025.02.18",
        "id": 2
    },
    {
        "name": "Концерт классической музыки",
        "date": "2025.03.05",
        "id": 3
    },
    {
        "name": "Чемпионат мира по шахматам",
        "date": "2025.04.12",
        "id": 4
    },
    {
        "name": "Научная выставка достижений в области физики",
        "date": "2025.05.20",
        "id": 5
    },
    {
        "name": "Литературный фестиваль",
        "date": "2025.06.15",
        "id": 6
    },
    {
        "name": "Выставка современных технологий",
        "date": "2025.07.08",
        "id": 7
    },
    {
        "name": "Фестиваль уличной еды",
        "date": "2025.08.25",
        "id": 8
    },
    {
        "name": "Маршрут выходного дня",
        "date": "2025.09.10",
        "id": 9
    },
    {
        "name": "Семинар по развитию предпринимательства",
        "date": "2025.10.03",
        "id": 10
    },
    {
        "name": "Деловой саммит инновационных компаний",
        "date": "2025.11.17",
        "id": 11
    },
    {
        "name": "Мастер-класс по робототехнике",
        "date": "2025.12.02",
        "id": 12
    },
    {
        "name": "Экологический форум",
        "date": "2025.01.25",
        "id": 13
    },
    {
        "name": "Конференция по искусственному интеллекту",
        "date": "2025.02.15",
        "id": 14
    },
    {
        "name": "Выставка современного искусства",
        "date": "2025.03.20",
        "id": 15
    },
    {
        "name": "Фестиваль документального кино",
        "date": "2025.04.05",
        "id": 16
    },
    {
        "name": "Соревнования по киберспорту",
        "date": "2025.05.12",
        "id": 17
    },
    {
        "name": "Международный экономический форум",
        "date": "2025.06.20",
        "id": 18
    },
    {
        "name": "Турнир по футболу среди любителей",
        "date": "2025.07.15",
        "id": 19
    },
    {
        "name": "Неделя моды",
        "date": "2025.08.28",
        "id": 20
    }
]

export const fakeSuperviser = [
    "Волкова Анна Михайловна",
    "Иванов Алексей Петрович",
    "Петрова Елена Сергеевна",
    "Смирнов Михаил Александрович",
    "Кузнецов Денис Владимирович"
]

export const fakeGroup = [
    '22ис-2',
    '23оат-1',
    '21оат-3',
    '25п-1',
    '25св-2',
]

export const fakeAllEvent = [
    { "id": 1, "name": "Смирнов Владимир Олегович", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 2, "name": "Симакина Анна Анатольевна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 3, "name": "Петров Михаил Васильевич", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 4, "name": "Иванова Людмила Николаевна", "2132": 0, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 5, "name": "Соловьев Александр Иванович", "2132": 1, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 6, "name": "Белкина Марина Сергеевна", "2132": 0, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 7, "name": "Егоров Владислав Евгеньевич", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 8, "name": "Кузнецова Оксана Александровна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 9, "name": "Семенов Константин Георгиевич", "2132": 1, "1132": 0, "112": 0, '1234': 1, '431': 0 },
    { "id": 10, "name": "Дементьева Татьяна Павловна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 11, "name": "Борисов Игорь Алексеевич", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 12, "name": "Павлова Дарья Дмитриевна", "2132": 0, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 13, "name": "Миронов Николай Михайлович", "2132": 1, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 14, "name": "Корнилова Галина Васильевна", "2132": 0, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 15, "name": "Андреев Леонид Павлович", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 16, "name": "Хохлова Надежда Сергеевна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 17, "name": "Фролов Юрий Геннадьевич", "2132": 1, "1132": 0, "112": 0, '1234': 1, '431': 0 },
    { "id": 18, "name": "Игнатова Валентина Ивановна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 19, "name": "Чернова Лариса Викторовна", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 20, "name": "Медведев Роман Валерьевич", "2132": 0, "1132": 0, "112": 0, '1234': 1, '431': 0 }
]

export const fakeAllEventColumn = [
    {
        accessorKey: 'name',
        header: "ФИО",
    },
    {
        accessorKey: '2132',
        header: "Турнир по футболу среди любителей"
    },
    {
        accessorKey: '1132',
        header: "Международный экономический форум"
    },
    {
        accessorKey: '112',
        header: "Конференция по искусственному интеллекту"
    },
    {
        accessorKey: '1234',
        header: "Конференция по искусственному интеллекту"
    },
    {
        accessorKey: '431',
        header: "Конференция по искусственному интеллекту"
    },
]